hathach/tinyusb/hw/bsp/msp_exp430f5529lp/msp430f5529.h
//values of USBVECINT when USB-interrupt occured
#define     USBVECINT_NONE     0x00
#define     USBVECINT_PWR_DROP 0x02
#define     USBVECINT_PLL_LOCK 0x04
#define     USBVECINT_PLL_SIGNAL 0x06
#define     USBVECINT_PLL_RANGE 0x08
#define     USBVECINT_PWR_VBUSOn 0x0A
#define     USBVECINT_PWR_VBUSOff 0x0C
#define     USBVECINT_USB_TIMESTAMP 0x10
#define     USBVECINT_INPUT_ENDPOINT0 0x12
#define     USBVECINT_OUTPUT_ENDPOINT0 0x14
#define     USBVECINT_RSTR     0x16
#define     USBVECINT_SUSR     0x18
#define     USBVECINT_RESR     0x1A
#define     USBVECINT_SETUP_PACKET_RECEIVED 0x20
#define     USBVECINT_STPOW_PACKET_RECEIVED 0x22
#define     USBVECINT_INPUT_ENDPOINT1 0x24
#define     USBVECINT_INPUT_ENDPOINT2 0x26
#define     USBVECINT_INPUT_ENDPOINT3 0x28
#define     USBVECINT_INPUT_ENDPOINT4 0x2A
#define     USBVECINT_INPUT_ENDPOINT5 0x2C
#define     USBVECINT_INPUT_ENDPOINT6 0x2E
#define     USBVECINT_INPUT_ENDPOINT7 0x30
#define     USBVECINT_OUTPUT_ENDPOINT1 0x32
#define     USBVECINT_OUTPUT_ENDPOINT2 0x34
#define     USBVECINT_OUTPUT_ENDPOINT3 0x36
#define     USBVECINT_OUTPUT_ENDPOINT4 0x38
#define     USBVECINT_OUTPUT_ENDPOINT5 0x3A
#define     USBVECINT_OUTPUT_ENDPOINT6 0x3C
#define     USBVECINT_OUTPUT_ENDPOINT7 0x3E


/* ========================================================================= */
/* USB Operation Registers */
/* ========================================================================= */

sfr_b(USBIEPSIZXY_7);                         /* Input Endpoint_7: X/Y-buffer size  */
sfr_b(USBIEPBCTY_7);                          /* Input Endpoint_7: Y-byte count  */
sfr_b(USBIEPBBAY_7);                          /* Input Endpoint_7: Y-buffer base addr.  */
//sfrb    Spare       (0x23FC)   /* Not used  */
//sfrb    Spare       (0x23FB)   /* Not used  */
sfr_b(USBIEPBCTX_7);                          /* Input Endpoint_7: X-byte count  */
sfr_b(USBIEPBBAX_7);                          /* Input Endpoint_7: X-buffer base addr. */
sfr_b(USBIEPCNF_7);                           /* Input Endpoint_7: Configuration  */
sfr_b(USBIEPSIZXY_6);                         /* Input Endpoint_6: X/Y-buffer size  */
sfr_b(USBIEPBCTY_6);                          /* Input Endpoint_6: Y-byte count */
sfr_b(USBIEPBBAY_6);                          /* Input Endpoint_6: Y-buffer base addr. */
//sfrb    Spare       (0x23F4)   /* Not used  */
//sfrb    Spare       (0x23F3)   /* Not used  */
sfr_b(USBIEPBCTX_6);                          /* Input Endpoint_6: X-byte count */
sfr_b(USBIEPBBAX_6);                          /* Input Endpoint_6: X-buffer base addr. */
sfr_b(USBIEPCNF_6);                           /* Input Endpoint_6: Configuration */
sfr_b(USBIEPSIZXY_5);                         /* Input Endpoint_5: X/Y-buffer size */
sfr_b(USBIEPBCTY_5);                          /* Input Endpoint_5: Y-byte count */
sfr_b(USBIEPBBAY_5);                          /* Input Endpoint_5: Y-buffer base addr. */
//sfrb    Spare       (0x23EC)   /* Not used */
//sfrb    Spare       (0x23EB)   /* Not used */
sfr_b(USBIEPBCTX_5);                          /* Input Endpoint_5: X-byte count */
sfr_b(USBIEPBBAX_5);                          /* Input Endpoint_5: X-buffer base addr. */
sfr_b(USBIEPCNF_5);                           /* Input Endpoint_5: Configuration */
sfr_b(USBIEPSIZXY_4);                         /* Input Endpoint_4: X/Y-buffer size */
sfr_b(USBIEPBCTY_4);                          /* Input Endpoint_4: Y-byte count */
sfr_b(USBIEPBBAY_4);                          /* Input Endpoint_4: Y-buffer base addr. */
//sfrb    Spare       (0x23E4)   /* Not used */
//sfrb    Spare       (0x23E3)   /* Not used */
sfr_b(USBIEPBCTX_4);                          /* Input Endpoint_4: X-byte count */
sfr_b(USBIEPBBAX_4);                          /* Input Endpoint_4: X-buffer base addr. */
sfr_b(USBIEPCNF_4);                           /* Input Endpoint_4: Configuration */
sfr_b(USBIEPSIZXY_3);                         /* Input Endpoint_3: X/Y-buffer size */
sfr_b(USBIEPBCTY_3);                          /* Input Endpoint_3: Y-byte count */
sfr_b(USBIEPBBAY_3);                          /* Input Endpoint_3: Y-buffer base addr. */
//sfrb    Spare       (0x23DC)   /* Not used */
//sfrb    Spare       (0x23DB)   /* Not used */
sfr_b(USBIEPBCTX_3);                          /* Input Endpoint_3: X-byte count */
sfr_b(USBIEPBBAX_3);                          /* Input Endpoint_3: X-buffer base addr. */
sfr_b(USBIEPCNF_3);                           /* Input Endpoint_3: Configuration */
sfr_b(USBIEPSIZXY_2);                         /* Input Endpoint_2: X/Y-buffer size */
sfr_b(USBIEPBCTY_2);                          /* Input Endpoint_2: Y-byte count */
sfr_b(USBIEPBBAY_2);                          /* Input Endpoint_2: Y-buffer base addr. */
//sfrb    Spare       (0x23D4)   /* Not used */
//sfrb    Spare       (0x23D3)   /* Not used */
sfr_b(USBIEPBCTX_2);                          /* Input Endpoint_2: X-byte count */
sfr_b(USBIEPBBAX_2);                          /* Input Endpoint_2: X-buffer base addr. */
sfr_b(USBIEPCNF_2);                           /* Input Endpoint_2: Configuration */
sfr_b(USBIEPSIZXY_1);                         /* Input Endpoint_1: X/Y-buffer size */
sfr_b(USBIEPBCTY_1);                          /* Input Endpoint_1: Y-byte count */
sfr_b(USBIEPBBAY_1);                          /* Input Endpoint_1: Y-buffer base addr. */
//sfrb    Spare       (0x23CC)   /* Not used */
//sfrb    Spare       (0x23CB)   /* Not used */
sfr_b(USBIEPBCTX_1);                          /* Input Endpoint_1: X-byte count */
sfr_b(USBIEPBBAX_1);                          /* Input Endpoint_1: X-buffer base addr. */
sfr_b(USBIEPCNF_1);                           /* Input Endpoint_1: Configuration */
//sfrb       (0x23C7)   /* */
//sfrb     RESERVED         (0x1C00)    /* */
//sfrb       (0x23C0)   /* */
sfr_b(USBOEPSIZXY_7);                         /* Output Endpoint_7: X/Y-buffer size */
sfr_b(USBOEPBCTY_7);                          /* Output Endpoint_7: Y-byte count */
sfr_b(USBOEPBBAY_7);                          /* Output Endpoint_7: Y-buffer base addr. */
//sfrb    Spare       (0x23BC)   /* Not used */
//sfrb    Spare       (0x23BB)   /* Not used */
sfr_b(USBOEPBCTX_7);                          /* Output Endpoint_7: X-byte count */
sfr_b(USBOEPBBAX_7);                          /* Output Endpoint_7: X-buffer base addr. */
sfr_b(USBOEPCNF_7);                           /* Output Endpoint_7: Configuration */
sfr_b(USBOEPSIZXY_6);                         /* Output Endpoint_6: X/Y-buffer size */
sfr_b(USBOEPBCTY_6);                          /* Output Endpoint_6: Y-byte count */
sfr_b(USBOEPBBAY_6);                          /* Output Endpoint_6: Y-buffer base addr. */
//sfrb    Spare       (0x23B4)   /* Not used */
//sfrb    Spare       (0x23B3)   /* Not used */
sfr_b(USBOEPBCTX_6);                          /* Output Endpoint_6: X-byte count */
sfr_b(USBOEPBBAX_6);                          /* Output Endpoint_6: X-buffer base addr. */
sfr_b(USBOEPCNF_6);                           /* Output Endpoint_6: Configuration */
sfr_b(USBOEPSIZXY_5);                         /* Output Endpoint_5: X/Y-buffer size */
sfr_b(USBOEPBCTY_5);                          /* Output Endpoint_5: Y-byte count */
sfr_b(USBOEPBBAY_5);                          /* Output Endpoint_5: Y-buffer base addr. */
//sfrb    Spare       (0x23AC)   /* Not used */
//sfrb    Spare       (0x23AB)   /* Not used */
sfr_b(USBOEPBCTX_5);                          /* Output Endpoint_5: X-byte count */
sfr_b(USBOEPBBAX_5);                          /* Output Endpoint_5: X-buffer base addr. */
sfr_b(USBOEPCNF_5);                           /* Output Endpoint_5: Configuration */
sfr_b(USBOEPSIZXY_4);                         /* Output Endpoint_4: X/Y-buffer size */
sfr_b(USBOEPBCTY_4);                          /* Output Endpoint_4: Y-byte count */
sfr_b(USBOEPBBAY_4);                          /* Output Endpoint_4: Y-buffer base addr. */
//sfrb    Spare       (0x23A4)   /* Not used */
//sfrb    Spare       (0x23A3)   /* Not used */
sfr_b(USBOEPBCTX_4);                          /* Output Endpoint_4: X-byte count */
sfr_b(USBOEPBBAX_4);                          /* Output Endpoint_4: X-buffer base addr. */
sfr_b(USBOEPCNF_4);                           /* Output Endpoint_4: Configuration */
sfr_b(USBOEPSIZXY_3);                         /* Output Endpoint_3: X/Y-buffer size */
sfr_b(USBOEPBCTY_3);                          /* Output Endpoint_3: Y-byte count */
sfr_b(USBOEPBBAY_3);                          /* Output Endpoint_3: Y-buffer base addr. */
//sfrb    Spare       (0x239C)   /* Not used */
//sfrb    Spare       (0x239B)   /* Not used */
sfr_b(USBOEPBCTX_3);                          /* Output Endpoint_3: X-byte count */
sfr_b(USBOEPBBAX_3);                          /* Output Endpoint_3: X-buffer base addr. */
sfr_b(USBOEPCNF_3);                           /* Output Endpoint_3: Configuration */
sfr_b(USBOEPSIZXY_2);                         /* Output Endpoint_2: X/Y-buffer size */
sfr_b(USBOEPBCTY_2);                          /* Output Endpoint_2: Y-byte count */
sfr_b(USBOEPBBAY_2);                          /* Output Endpoint_2: Y-buffer base addr. */
//sfrb    Spare       (0x2394)   /* Not used */
//sfrb    Spare       (0x2393)   /* Not used */
sfr_b(USBOEPBCTX_2);                          /* Output Endpoint_2: X-byte count */
sfr_b(USBOEPBBAX_2);                          /* Output Endpoint_2: X-buffer base addr. */
sfr_b(USBOEPCNF_2);                           /* Output Endpoint_2: Configuration */
sfr_b(USBOEPSIZXY_1);                         /* Output Endpoint_1: X/Y-buffer size */
sfr_b(USBOEPBCTY_1);                          /* Output Endpoint_1: Y-byte count */
sfr_b(USBOEPBBAY_1);                          /* Output Endpoint_1: Y-buffer base addr. */
//sfrb    Spare       (0x238C)   /* Not used */
//sfrb    Spare       (0x238B)   /* Not used */
sfr_b(USBOEPBCTX_1);                          /* Output Endpoint_1: X-byte count */
sfr_b(USBOEPBBAX_1);                          /* Output Endpoint_1: X-buffer base addr. */
sfr_b(USBOEPCNF_1);                           /* Output Endpoint_1: Configuration */
sfr_b(USBSUBLK);                              /* Setup Packet Block */
sfr_b(USBIEP0BUF);                            /* Input endpoint_0 buffer */
sfr_b(USBOEP0BUF);                            /* Output endpoint_0 buffer */
sfr_b(USBTOPBUFF);                            /* Top of buffer space */
//         (1904 Bytes)               /* Buffer space */
sfr_b(USBSTABUFF);                            /* Start of buffer space */

/* USBIEPCNF_n Control Bits */
/* USBOEPCNF_n Control Bits */
//#define RESERVED       (0x0001)  /* USB -  */
//#define RESERVED       (0x0001)  /* USB -  */
#define DBUF                   (0x0010)       /* USB - Double Buffer Enable */
//#define RESERVED       (0x0040)  /* USB -  */

/* USBIEPBCNT_n Control Bits */
/* USBOEPBCNT_n Control Bits */
#define CNT4                   (0x0010)       /* USB - Byte Count Bit 3 */
#define CNT5                   (0x0020)       /* USB - Byte Count Bit 3 */
#define CNT6                   (0x0040)       /* USB - Byte Count Bit 3 */
/************************************************************
* UNIFIED CLOCK SYSTEM
************************************************************/
#define __MSP430_HAS_UCS__                    /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_UCS__ 0x0160
#define UCS_BASE               __MSP430_BASEADDRESS_UCS__

sfr_w(UCSCTL0);                               /* UCS Control Register 0 */
sfr_b(UCSCTL0_L);                             /* UCS Control Register 0 */
sfr_b(UCSCTL0_H);                             /* UCS Control Register 0 */
sfr_w(UCSCTL1);                               /* UCS Control Register 1 */
sfr_b(UCSCTL1_L);                             /* UCS Control Register 1 */
sfr_b(UCSCTL1_H);                             /* UCS Control Register 1 */
sfr_w(UCSCTL2);                               /* UCS Control Register 2 */
sfr_b(UCSCTL2_L);                             /* UCS Control Register 2 */
sfr_b(UCSCTL2_H);                             /* UCS Control Register 2 */
sfr_w(UCSCTL3);                               /* UCS Control Register 3 */
sfr_b(UCSCTL3_L);                             /* UCS Control Register 3 */
sfr_b(UCSCTL3_H);                             /* UCS Control Register 3 */
sfr_w(UCSCTL4);                               /* UCS Control Register 4 */
sfr_b(UCSCTL4_L);                             /* UCS Control Register 4 */
sfr_b(UCSCTL4_H);                             /* UCS Control Register 4 */
sfr_w(UCSCTL5);                               /* UCS Control Register 5 */
sfr_b(UCSCTL5_L);                             /* UCS Control Register 5 */
sfr_b(UCSCTL5_H);                             /* UCS Control Register 5 */
sfr_w(UCSCTL6);                               /* UCS Control Register 6 */
sfr_b(UCSCTL6_L);                             /* UCS Control Register 6 */
sfr_b(UCSCTL6_H);                             /* UCS Control Register 6 */
sfr_w(UCSCTL7);                               /* UCS Control Register 7 */
sfr_b(UCSCTL7_L);                             /* UCS Control Register 7 */
sfr_b(UCSCTL7_H);                             /* UCS Control Register 7 */
sfr_w(UCSCTL8);                               /* UCS Control Register 8 */
sfr_b(UCSCTL8_L);                             /* UCS Control Register 8 */
sfr_b(UCSCTL8_H);                             /* UCS Control Register 8 */

/* UCSCTL0 Control Bits */
//#define RESERVED            (0x0001)    /* RESERVED */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
#define MOD0                   (0x0008)       /* Modulation Bit Counter Bit : 0 */
#define MOD1                   (0x0010)       /* Modulation Bit Counter Bit : 1 */
#define MOD2                   (0x0020)       /* Modulation Bit Counter Bit : 2 */
#define MOD3                   (0x0040)       /* Modulation Bit Counter Bit : 3 */
#define MOD4                   (0x0080)       /* Modulation Bit Counter Bit : 4 */
#define DCO0                   (0x0100)       /* DCO TAP Bit : 0 */
#define DCO1                   (0x0200)       /* DCO TAP Bit : 1 */
#define DCO2                   (0x0400)       /* DCO TAP Bit : 2 */
#define DCO3                   (0x0800)       /* DCO TAP Bit : 3 */
#define DCO4                   (0x1000)       /* DCO TAP Bit : 4 */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL0 Control Bits */
//#define RESERVED            (0x0001)    /* RESERVED */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
#define MOD0_L                 (0x0008)       /* Modulation Bit Counter Bit : 0 */
#define MOD1_L                 (0x0010)       /* Modulation Bit Counter Bit : 1 */
#define MOD2_L                 (0x0020)       /* Modulation Bit Counter Bit : 2 */
#define MOD3_L                 (0x0040)       /* Modulation Bit Counter Bit : 3 */
#define MOD4_L                 (0x0080)       /* Modulation Bit Counter Bit : 4 */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL0 Control Bits */
//#define RESERVED            (0x0001)    /* RESERVED */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
#define DCO0_H                 (0x0001)       /* DCO TAP Bit : 0 */
#define DCO1_H                 (0x0002)       /* DCO TAP Bit : 1 */
#define DCO2_H                 (0x0004)       /* DCO TAP Bit : 2 */
#define DCO3_H                 (0x0008)       /* DCO TAP Bit : 3 */
#define DCO4_H                 (0x0010)       /* DCO TAP Bit : 4 */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL1 Control Bits */
#define DISMOD                 (0x0001)       /* Disable Modulation */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
//#define RESERVED            (0x0008)    /* RESERVED */
#define DCORSEL0               (0x0010)       /* DCO Freq. Range Select Bit : 0 */
#define DCORSEL1               (0x0020)       /* DCO Freq. Range Select Bit : 1 */
#define DCORSEL2               (0x0040)       /* DCO Freq. Range Select Bit : 2 */
//#define RESERVED            (0x0080)    /* RESERVED */
//#define RESERVED            (0x0100)    /* RESERVED */
//#define RESERVED            (0x0200)    /* RESERVED */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x1000)    /* RESERVED */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL1 Control Bits */
#define DISMOD_L               (0x0001)       /* Disable Modulation */
//#define RESERVED            (0x0002)    /* RESERVED */
//#define RESERVED            (0x0004)    /* RESERVED */
//#define RESERVED            (0x0008)    /* RESERVED */
#define DCORSEL0_L             (0x0010)       /* DCO Freq. Range Select Bit : 0 */
#define DCORSEL1_L             (0x0020)       /* DCO Freq. Range Select Bit : 1 */
#define DCORSEL2_L             (0x0040)       /* DCO Freq. Range Select Bit : 2 */
//#define RESERVED            (0x0080)    /* RESERVED */
//#define RESERVED            (0x0100)    /* RESERVED */
//#define RESERVED            (0x0200)    /* RESERVED */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x1000)    /* RESERVED */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

#define DCORSEL_0              (0x0000)       /* DCO RSEL 0 */
#define DCORSEL_1              (0x0010)       /* DCO RSEL 1 */
#define DCORSEL_2              (0x0020)       /* DCO RSEL 2 */
#define DCORSEL_3              (0x0030)       /* DCO RSEL 3 */
#define DCORSEL_4              (0x0040)       /* DCO RSEL 4 */
#define DCORSEL_5              (0x0050)       /* DCO RSEL 5 */
#define DCORSEL_6              (0x0060)       /* DCO RSEL 6 */
#define DCORSEL_7              (0x0070)       /* DCO RSEL 7 */

/* UCSCTL2 Control Bits */
#define FLLN0                  (0x0001)       /* FLL Multipier Bit : 0 */
#define FLLN1                  (0x0002)       /* FLL Multipier Bit : 1 */
#define FLLN2                  (0x0004)       /* FLL Multipier Bit : 2 */
#define FLLN3                  (0x0008)       /* FLL Multipier Bit : 3 */
#define FLLN4                  (0x0010)       /* FLL Multipier Bit : 4 */
#define FLLN5                  (0x0020)       /* FLL Multipier Bit : 5 */
#define FLLN6                  (0x0040)       /* FLL Multipier Bit : 6 */
#define FLLN7                  (0x0080)       /* FLL Multipier Bit : 7 */
#define FLLN8                  (0x0100)       /* FLL Multipier Bit : 8 */
#define FLLN9                  (0x0200)       /* FLL Multipier Bit : 9 */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
#define FLLD0                  (0x1000)       /* Loop Divider Bit : 0 */
#define FLLD1                  (0x2000)       /* Loop Divider Bit : 1 */
#define FLLD2                  (0x4000)       /* Loop Divider Bit : 1 */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL2 Control Bits */
#define FLLN0_L                (0x0001)       /* FLL Multipier Bit : 0 */
#define FLLN1_L                (0x0002)       /* FLL Multipier Bit : 1 */
#define FLLN2_L                (0x0004)       /* FLL Multipier Bit : 2 */
#define FLLN3_L                (0x0008)       /* FLL Multipier Bit : 3 */
#define FLLN4_L                (0x0010)       /* FLL Multipier Bit : 4 */
#define FLLN5_L                (0x0020)       /* FLL Multipier Bit : 5 */
#define FLLN6_L                (0x0040)       /* FLL Multipier Bit : 6 */
#define FLLN7_L                (0x0080)       /* FLL Multipier Bit : 7 */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

/* UCSCTL2 Control Bits */
#define FLLN8_H                (0x0001)       /* FLL Multipier Bit : 8 */
#define FLLN9_H                (0x0002)       /* FLL Multipier Bit : 9 */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
#define FLLD0_H                (0x0010)       /* Loop Divider Bit : 0 */
#define FLLD1_H                (0x0020)       /* Loop Divider Bit : 1 */
#define FLLD2_H                (0x0040)       /* Loop Divider Bit : 1 */
//#define RESERVED            (0x8000)    /* RESERVED */

#define FLLD_0                 (0x0000)       /* Multiply Selected Loop Freq. 1 */
#define FLLD_1                 (0x1000)       /* Multiply Selected Loop Freq. 2 */
#define FLLD_2                 (0x2000)       /* Multiply Selected Loop Freq. 4 */
#define FLLD_3                 (0x3000)       /* Multiply Selected Loop Freq. 8 */
#define FLLD_4                 (0x4000)       /* Multiply Selected Loop Freq. 16 */
#define FLLD_5                 (0x5000)       /* Multiply Selected Loop Freq. 32 */
#define FLLD_6                 (0x6000)       /* Multiply Selected Loop Freq. 32 */
#define FLLD_7                 (0x7000)       /* Multiply Selected Loop Freq. 32 */
#define FLLD__1                (0x0000)       /* Multiply Selected Loop Freq. By 1 */
#define FLLD__2                (0x1000)       /* Multiply Selected Loop Freq. By 2 */
#define FLLD__4                (0x2000)       /* Multiply Selected Loop Freq. By 4 */
#define FLLD__8                (0x3000)       /* Multiply Selected Loop Freq. By 8 */
#define FLLD__16               (0x4000)       /* Multiply Selected Loop Freq. By 16 */
#define FLLD__32               (0x5000)       /* Multiply Selected Loop Freq. By 32 */

/* UCSCTL3 Control Bits */
#define FLLREFDIV0             (0x0001)       /* Reference Divider Bit : 0 */
#define FLLREFDIV1             (0x0002)       /* Reference Divider Bit : 1 */
#define FLLREFDIV2             (0x0004)       /* Reference Divider Bit : 2 */
//#define RESERVED            (0x0008)    /* RESERVED */
#define SELREF0                (0x0010)       /* FLL Reference Clock Select Bit : 0 */
#define SELREF1                (0x0020)       /* FLL Reference Clock Select Bit : 1 */
#define SELREF2                (0x0040)       /* FLL Reference Clock Select Bit : 2 */
//#define RESERVED            (0x0080)    /* RESERVED */
//#define RESERVED            (0x0100)    /* RESERVED */
//#define RESERVED            (0x0200)    /* RESERVED */
//#define RESERVED            (0x0400)    /* RESERVED */
//#define RESERVED            (0x0800)    /* RESERVED */
//#define RESERVED            (0x1000)    /* RESERVED */
//#define RESERVED            (0x2000)    /* RESERVED */
//#define RESERVED            (0x4000)    /* RESERVED */
//#define RESERVED            (0x8000)    /* RESERVED */

